Rechnerubung/Week7/Parameterstudien_mit_RANS/data/raw/AOA_12/system/forceCoeffs_object
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      forceCoeffsIncompressible;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Import alpha_RAD and mag_U_infty from global variables
#include "globalVariables"
// Use these variables by "$<<variableName>>"

// calculate stability axis
x_ (#calc "sin($alpha_RAD)" #calc "cos($alpha_RAD)" 0);
y_ (#calc "cos($alpha_RAD)" #calc "-sin($alpha_RAD)" 0);

// define forceCoeffs_object
forceCoeffs_object
{
	type 	forceCoeffs;
	functionObjectLibs ("libforces.so");
	patches (suction_side pressure_side trailing_edge);

	p 	p;
	U 	U;
	rho rhoInf;			  // Reference Density 
	rhoInf 1;			  // Density
	
	log 	true;		  // Dump to file -- change to false to not save a file 

	CofR 	(0.25 0 0);   // Centre of rotation (c/4)
	liftDir $y_;	      // Direction of lift coefficient
	dragDir $x_;		  // Direction of drag coefficient
	pitchAxis (0 0 -1);	  // Pitch moment axis
	magUInf $mag_U_infty; // free stream velocity magnitude 
	lRef 1;         	  // reference length (chord length)
	Aref 1;         	  // reference area: c*span

    outputControl   timeStep;
    outputInterval  1;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
